# Import Pandas Library

In [1]:
import pandas as pd
import numpy as np

# Data Structures

## First: Series

In [2]:
lst = [1,2,3,4,5] 
s = pd.Series(lst, name="value")
s

0    1
1    2
2    3
3    4
4    5
Name: value, dtype: int64

In [3]:
# change dtype
s = pd.Series(lst, dtype= float)
s

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [4]:
# choose indexes
s = pd.Series(lst, index=['A', 'B', 'C', 'D', 'E' ])
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [5]:
index = [10, 12, 13, 14]
names = ['Nourah', 'Sarah', 'Ahmed', 'Lama']
s2 = pd.Series(names, index=index)
s2

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [6]:
# use dictionary 
names = {10: 'Nourah', 12: 'Sarah', 13: 'Ahmed', 14: 'Lama'}
s3 = pd.Series(names)
s3

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [7]:
names.keys()

dict_keys([10, 12, 13, 14])

In [8]:
pd.Series(names.keys(), index=names.values())

Nourah    10
Sarah     12
Ahmed     13
Lama      14
dtype: int64

In [9]:
s3

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [10]:
s3.values

array(['Nourah', 'Sarah', 'Ahmed', 'Lama'], dtype=object)

In [11]:
list(range(4))

[0, 1, 2, 3]

In [12]:
s3

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [13]:
# change the indexes
s3.index = range(4)
s3[0:3]

0    Nourah
1     Sarah
2     Ahmed
dtype: object

In [14]:
# Selecting
print(s3[2]) # index = 2

Ahmed

In [15]:
# Slicing like numpy [start, end(execluded), gap]
# Note that the slice does not use the index labels as references, but the position
s3[:3] # from position 0 to 2

0    Nourah
1     Sarah
2     Ahmed
dtype: object

In [16]:
s3

0    Nourah
1     Sarah
2     Ahmed
3      Lama
dtype: object

In [17]:
s3[:-1] # from 0 to last item(execluded)

0    Nourah
1     Sarah
2     Ahmed
dtype: object

In [18]:
s3

0    Nourah
1     Sarah
2     Ahmed
3      Lama
dtype: object

In [19]:
s4 = pd.Series(['Naif','Dania'])
s3 = s3._append(s4)
s3

0    Nourah
1     Sarah
2     Ahmed
3      Lama
0      Naif
1     Dania
dtype: object

In [20]:
s3[0]

0    Nourah
0      Naif
dtype: object

In [21]:
s3.to_dict()

{0: 'Naif', 1: 'Dania', 2: 'Ahmed', 3: 'Lama'}

In [22]:
# Add elements 
s4 = pd.Series({50: 'Naif', 60: 'Dania'})
s3 = s3._append(s4)
s3

0     Nourah
1      Sarah
2      Ahmed
3       Lama
0       Naif
1      Dania
50      Naif
60     Dania
dtype: object

In [23]:
x = pd.Series(['a', 'b'])
y = pd.Series(['c', 'd'])

In [24]:
x

0    a
1    b
dtype: object

In [25]:
y

0    c
1    d
dtype: object

In [26]:
z = pd.concat([x, y])
z

0    a
1    b
0    c
1    d
dtype: object

In [27]:
z.reset_index(inplace=True, drop=True)
z

0    a
1    b
2    c
3    d
dtype: object

In [28]:
z = z.reset_index(drop=True)
z

0    a
1    b
2    c
3    d
dtype: object

In [29]:
z

0    a
1    b
2    c
3    d
dtype: object

In [30]:
z = pd.concat([x, y],ignore_index=True )
z

0    a
1    b
2    c
3    d
dtype: object

In [31]:
s3

0     Nourah
1      Sarah
2      Ahmed
3       Lama
0       Naif
1      Dania
50      Naif
60     Dania
dtype: object

In [32]:
s3[1:4]

1    Sarah
2    Ahmed
3     Lama
dtype: object

In [33]:
s3[1:4].index

Index([1, 2, 3], dtype='int64')

In [34]:
s3.drop(index=s3[1:4].index)

0     Nourah
0       Naif
50      Naif
60     Dania
dtype: object

In [35]:
s3

0     Nourah
1      Sarah
2      Ahmed
3       Lama
0       Naif
1      Dania
50      Naif
60     Dania
dtype: object

In [36]:
# delete an element 
s3 = s3.drop(s3[:1].index)

In [37]:
s3[:1]

1    Sarah
dtype: object

In [38]:
s3

1     Sarah
2     Ahmed
3      Lama
1     Dania
50     Naif
60    Dania
dtype: object

In [39]:
# drop duplicate elements
s3 = s3.drop_duplicates()
s3

1     Sarah
2     Ahmed
3      Lama
1     Dania
50     Naif
dtype: object

In [40]:
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [41]:
s4 = s.copy()
s4

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [42]:
s4 = s4+3
s4

A    4
B    5
C    6
D    7
E    8
dtype: int64

In [43]:
s4.add(s)

A     5
B     7
C     9
D    11
E    13
dtype: int64

In [44]:
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [45]:
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [46]:
s5 = pd.Series({'A': 6, 'B': 8})
s5

A    6
B    8
dtype: int64

In [47]:
s5 = s5.add(s, fill_value=0)

In [48]:
s5 # you have to save the result

A     7.0
B    10.0
C     3.0
D     4.0
E     5.0
dtype: float64

In [49]:
s4

A    4
B    5
C    6
D    7
E    8
dtype: int64

In [50]:
s4.sub(s)

A    3
B    3
C    3
D    3
E    3
dtype: int64

In [51]:
s4.mul(s)

A     4
B    10
C    18
D    28
E    40
dtype: int64

In [52]:
s4.div(s)

A    4.00
B    2.50
C    2.00
D    1.75
E    1.60
dtype: float64

## Second: DataFrame

### A- Creating a new DataFrame from the scratch

In [ ]:
s4 = pd.Series({50: 'Naif', 60: 'Dania'})

In [55]:
data = {'SalesPerson': ['Kathey', 'Michael', 'William', 'Kathey', 'William', 'Kathey', 'Michael'],
        'Region': ['East', 'West', 'North', 'South', 'North', 'North', 'East'],
        'OrderAmount': [600, 700, 400, 500, 400, 700, 800],
        'Month': ['Jan', 'Feb', 'Feb', 'Mar', 'May', 'Apr', 'May'],
        'isAccepted': [True, False, False, True, True, True, False]
       }

SalesDF = pd.DataFrame(data, index= range(10, 17))
SalesDF

   SalesPerson Region  OrderAmount Month  isAccepted
10      Kathey   East          600   Jan        True
11     Michael   West          700   Feb       False
12     William  North          400   Feb       False
13      Kathey  South          500   Mar        True
14     William  North          400   May        True
15      Kathey  North          700   Apr        True
16     Michael   East          800   May       False

In [59]:
SalesDF[['SalesPerson']]

   SalesPerson
10      Kathey
11     Michael
12     William
13      Kathey
14     William
15      Kathey
16     Michael

In [60]:
data = {'year': [2010, 2011, 2012, 2010, 2011, 2012, 2010, 2011, 2012],
        'team': ['FCBarcelona', 'FCBarcelona', 'FCBarcelona', 'RMadrid', 'RMadrid', 'RMadrid', 'ValenciaCF',
                 'ValenciaCF', 'ValenciaCF'],
        'wins':   [30, 28, 32, 29, 32, 26, 21, 17, 19],
        'draws':  [6, 7, 4, 5, 4, 7, 8, 10, 8],
        'losses': [2, 3, 2, 4, 2, 5, 9, 11, 11]}

football = pd.DataFrame(data)
football

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

### B- Reading tabular data

In [61]:
edu = pd.read_csv('Data/educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [62]:
edu.shape

(384, 5)

In [63]:
edu.columns

Index(['TIME', 'GEO', 'INDIC_ED', 'Value', 'Flag and Footnotes'], dtype='object')

In [64]:
edu.size

1920

In [66]:
type(edu)

pandas.core.frame.DataFrame

In [65]:
edu.dtypes

TIME                   int64
GEO                   object
INDIC_ED              object
Value                 object
Flag and Footnotes    object
dtype: object

# Viewing Data

In [67]:
edu.head() #first rows that are listed

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [69]:
edu.head(300)

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
295,2007,Netherlands,Total public expenditure on education as % of ...,5.32,NaN
296,2008,Netherlands,Total public expenditure on education as % of ...,5.50,NaN
297,2009,Netherlands,Total public expenditure on education as % of ...,5.95,NaN
298,2010,Netherlands,Total public expenditure on education as % of ...,5.98,NaN
299,2011,Netherlands,Total public expenditure on education as % of ...,5.93,NaN

In [70]:
edu.shape

(384, 5)

In [71]:
edu.tail() #last rows that are listed

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [73]:
edu.columns = ['TIME', 'GEO_2', 'A', 'Value', 'Flag and Footnotes']

In [74]:
edu.head(2)

,TIME,GEO_2,A,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN

In [77]:
edu = edu.rename(columns={"GEO_2": "GEO"})

In [78]:
edu.head(2)

,TIME,GEO,A,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN

In [80]:
edu.columns[2]

'A'

In [86]:
edu.index = range(5, 389)

In [88]:
edu

,TIME,GEO,A,Value,Flag and Footnotes
5,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
6,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
7,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
8,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
9,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
384,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
385,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
386,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
387,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
388,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [87]:
edu.index

RangeIndex(start=5, stop=389, step=1)

In [91]:
edu.values # values of any DataFrame can be retrieved as a Python array by calling its values attribute.

array([[2000, 'European Union (28 countries)',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        ':', nan],
       [2001, 'European Union (28 countries)',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        ':', nan],
       [2002, 'European Union (28 countries)',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '5.00', 'e'],
       ...,
       [2009, 'Finland',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '6.81', nan],
       [2010, 'Finland',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '6.85', nan],
       [2011, 'Finland',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '6.76', nan]], dtype=object)

In [92]:
edu.head(2)

,TIME,GEO,A,Value,Flag and Footnotes
5,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
6,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN

In [93]:
edu.dtypes

TIME                   int64
GEO                   object
A                     object
Value                 object
Flag and Footnotes    object
dtype: object

In [94]:
edu.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 384 entries, 5 to 388
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   TIME                384 non-null    int64
 1   GEO                 384 non-null    object
 2   A                   384 non-null    object
 3   Value               384 non-null    object
 4   Flag and Footnotes  165 non-null    object
dtypes: int64(1), object(4)
memory usage: 15.1+ KB

In [95]:
# quick statistical information
edu.describe()

              TIME
count   384.000000
mean   2005.500000
std       3.456556
min    2000.000000
25%    2002.750000
50%    2005.500000
75%    2008.250000
max    2011.000000

In [96]:
edu.describe(include=[object])

,GEO,A,Value,Flag and Footnotes
count,384,384,384,165
unique,32,1,211,6
top,European Union (28 countries),Total public expenditure on education as % of ...,:,e
freq,12,384,23,70

In [101]:
edu.describe(exclude="number")

,GEO,A,Value,Flag and Footnotes
count,384,384,384,165
unique,32,1,211,6
top,European Union (28 countries),Total public expenditure on education as % of ...,:,e
freq,12,384,23,70

In [98]:
edu.T

,5,6,7,8,9,10,11,12,13,14,...,379,380,381,382,383,384,385,386,387,388
TIME,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,...,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011
GEO,European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),...,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland
A,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...
Value,:,:,5.00,5.03,4.95,4.92,4.91,4.92,5.04,5.38,...,6.22,6.43,6.42,6.30,6.18,5.90,6.10,6.81,6.85,6.76
Flag and Footnotes,NaN,NaN,e,e,e,e,e,e,e,e,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# Selection

In [102]:
edu.head(2)

,TIME,GEO,A,Value,Flag and Footnotes
5,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
6,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN

In [103]:
edu['Value']

5         :
6         :
7      5.00
8      5.03
9      4.95
       ...
384    5.90
385    6.10
386    6.81
387    6.85
388    6.76
Name: Value, Length: 384, dtype: object

In [104]:
type(edu['Value']) # The result will be a Series data structure, not a DataFrame, because only one column is retrieved.

pandas.core.series.Series

In [105]:
edu[['Value','GEO']]

    Value                            GEO
5       :  European Union (28 countries)
6       :  European Union (28 countries)
7    5.00  European Union (28 countries)
8    5.03  European Union (28 countries)
9    4.95  European Union (28 countries)
..    ...                            ...
384  5.90                        Finland
385  6.10                        Finland
386  6.81                        Finland
387  6.85                        Finland
388  6.76                        Finland

[384 rows x 2 columns]

In [106]:
edu[10:14] # select a subset of rows from a DataFrame

,TIME,GEO,A,Value,Flag and Footnotes
15,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
16,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
17,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
18,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s

In [112]:
edu.head()

,TIME,GEO,A,Value,Flag and Footnotes
5,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
6,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
7,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
8,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
9,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [108]:
edu.iloc[ 0:3 , 0:2]

   TIME                            GEO
5  2000  European Union (28 countries)
6  2001  European Union (28 countries)
7  2002  European Union (28 countries)

In [114]:
edu.loc[ [5, 21, 32] , ['Value','GEO']]  #[rows, columns]

   Value                            GEO
5      :  European Union (28 countries)
21  4.95  European Union (27 countries)
32  5.06  European Union (25 countries)

In [115]:
edu.loc[90:94,:] #[rows, columns=all]

,TIME,GEO,A,Value,Flag and Footnotes
90,2001,Belgium,Total public expenditure on education as % of ...,5.99,i
91,2002,Belgium,Total public expenditure on education as % of ...,6.09,d
92,2003,Belgium,Total public expenditure on education as % of ...,6.02,d
93,2004,Belgium,Total public expenditure on education as % of ...,5.95,d
94,2005,Belgium,Total public expenditure on education as % of ...,5.92,d

In [116]:
edu.head()

,TIME,GEO,A,Value,Flag and Footnotes
5,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
6,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
7,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
8,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
9,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [117]:
edu.sample(5, random_state=23) # random sample >> 23 seed for random number generator.
# seed makes the random numbers predictable

,TIME,GEO,A,Value,Flag and Footnotes
299,2006,Netherlands,Total public expenditure on education as % of ...,5.50,NaN
348,2007,Romania,Total public expenditure on education as % of ...,4.25,NaN
183,2010,Greece,Total public expenditure on education as % of ...,:,NaN
78,2001,Euro area (13 countries),Total public expenditure on education as % of ...,4.97,s
289,2008,Malta,Total public expenditure on education as % of ...,5.72,i

# Filtering Data

In [125]:
edu.columns

Index(['TIME', 'GEO', 'A', 'Value', 'Flag and Footnotes'], dtype='object')

In [124]:
edu[edu['TIME'] == 2004]

,TIME,GEO,A,Value,Flag and Footnotes
9,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
21,2004,European Union (27 countries),Total public expenditure on education as % of ...,4.95,e
33,2004,European Union (25 countries),Total public expenditure on education as % of ...,4.98,e
45,2004,Euro area (18 countries),Total public expenditure on education as % of ...,4.80,e
57,2004,Euro area (17 countries),Total public expenditure on education as % of ...,4.80,e
69,2004,Euro area (15 countries),Total public expenditure on education as % of ...,4.96,e
81,2004,Euro area (13 countries),Total public expenditure on education as % of ...,4.95,e
93,2004,Belgium,Total public expenditure on education as % of ...,5.95,d
105,2004,Bulgaria,Total public expenditure on education as % of ...,4.40,NaN
117,2004,Czech Republic,Total public expenditure on education as % of ...,4.20,NaN
129,2004,Denmark,Total public expenditure on education as % of ...,8.43,NaN
141,2004,Germany (until 1990 former territory of the FRG),Total public expenditure on education as % of ...,4.62,NaN
153,2004,Estonia,Total public expenditure on education as % of ...,4.92,NaN
165,2004,Ireland,Total public expenditure on education as % of ...,4.66,NaN
177,2004,Greece,Total public expenditure on education as % of ...,3.83,i
189,2004,Spain,Total public expenditure on education as % of ...,4.25,NaN
201,2004,France,Total public expenditure on education as % of ...,5.80,NaN
213,2004,Italy,Total public expenditure on education as % of ...,4.56,NaN
225,2004,Cyprus,Total public expenditure on education as % of ...,6.77,d
237,2004,Latvia,Total public expenditure on education as % of ...,5.12,NaN
249,2004,Lithuania,Total public expenditure on education as % of ...,5.17,NaN
261,2004,Luxembourg,Total public expenditure on education as % of ...,3.87,d
273,2004,Hungary,Total public expenditure on education as % of ...,5.44,NaN
285,2004,Malta,Total public expenditure on education as % of ...,4.66,NaN
297,2004,Netherlands,Total public expenditure on education as % of ...,5.50,NaN
309,2004,Austria,Total public expenditure on education as % of ...,5.48,NaN
321,2004,Poland,Total public expenditure on education as % of ...,5.41,d
333,2004,Portugal,Total public expenditure on education as % of ...,5.10,d
345,2004,Romania,Total public expenditure on education as % of ...,3.28,NaN
357,2004,Slovenia,Total public expenditure on education as % of ...,5.74,NaN
369,2004,Slovakia,Total public expenditure on education as % of ...,4.19,d
381,2004,Finland,Total public expenditure on education as % of ...,6.42,NaN

In [120]:
edu['TIME'] == 2004

5      False
6      False
7      False
8      False
9       True
       ...
384    False
385    False
386    False
387    False
388    False
Name: TIME, Length: 384, dtype: bool

In [126]:
edu[edu['TIME'] == 2011]

,TIME,GEO,A,Value,Flag and Footnotes
16,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
28,2011,European Union (27 countries),Total public expenditure on education as % of ...,5.25,e
40,2011,European Union (25 countries),Total public expenditure on education as % of ...,5.31,e
52,2011,Euro area (18 countries),Total public expenditure on education as % of ...,5.15,e
64,2011,Euro area (17 countries),Total public expenditure on education as % of ...,5.15,e
76,2011,Euro area (15 countries),Total public expenditure on education as % of ...,5.16,e
88,2011,Euro area (13 countries),Total public expenditure on education as % of ...,5.15,e
100,2011,Belgium,Total public expenditure on education as % of ...,6.55,d
112,2011,Bulgaria,Total public expenditure on education as % of ...,3.82,NaN
124,2011,Czech Republic,Total public expenditure on education as % of ...,4.51,NaN
136,2011,Denmark,Total public expenditure on education as % of ...,8.75,d
148,2011,Germany (until 1990 former territory of the FRG),Total public expenditure on education as % of ...,4.98,NaN
160,2011,Estonia,Total public expenditure on education as % of ...,5.16,NaN
172,2011,Ireland,Total public expenditure on education as % of ...,6.15,NaN
184,2011,Greece,Total public expenditure on education as % of ...,:,NaN
196,2011,Spain,Total public expenditure on education as % of ...,4.82,NaN
208,2011,France,Total public expenditure on education as % of ...,5.68,NaN
220,2011,Italy,Total public expenditure on education as % of ...,4.29,NaN
232,2011,Cyprus,Total public expenditure on education as % of ...,7.87,d
244,2011,Latvia,Total public expenditure on education as % of ...,4.96,NaN
256,2011,Lithuania,Total public expenditure on education as % of ...,5.17,NaN
268,2011,Luxembourg,Total public expenditure on education as % of ...,:,NaN
280,2011,Hungary,Total public expenditure on education as % of ...,4.71,NaN
292,2011,Malta,Total public expenditure on education as % of ...,7.96,NaN
304,2011,Netherlands,Total public expenditure on education as % of ...,5.93,NaN
316,2011,Austria,Total public expenditure on education as % of ...,5.80,NaN
328,2011,Poland,Total public expenditure on education as % of ...,4.94,NaN
340,2011,Portugal,Total public expenditure on education as % of ...,5.27,d
352,2011,Romania,Total public expenditure on education as % of ...,3.07,NaN
364,2011,Slovenia,Total public expenditure on education as % of ...,5.68,NaN
376,2011,Slovakia,Total public expenditure on education as % of ...,4.06,d
388,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [127]:
# Another way of selection
# by applying Boolean indexing. This indexing is commonly known as a filter. 
edu[edu['Value'] > 6.5]

TypeError: '>' not supported between instances of 'str' and 'float'

# Filtering Missing and dupliacated Values

In [131]:
edu['TIME'] >=2007

5      False
6      False
7      False
8      False
9      False
       ...
384     True
385     True
386     True
387     True
388     True
Name: TIME, Length: 384, dtype: bool

In [136]:
edu[(edu['Value'] != ':') & (edu['TIME'] >=2007)]

,TIME,GEO,A,Value,Flag and Footnotes
12,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
13,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
14,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
15,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
16,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
...,...,...,...,...,...
384,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
385,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
386,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
387,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
388,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [132]:
(edu['Value'] == ':') & (edu['TIME'] >=2007)

5      False
6      False
7      False
8      False
9      False
       ...
384    False
385    False
386    False
387    False
388    False
Length: 384, dtype: bool

In [ ]:
edu[(~edu['Flag and Footnotes'].isnull()) & (edu['TIME'] == 2011) ]

In [140]:
edu[edu['Flag and Footnotes'].isnull()]

,TIME,GEO,A,Value,Flag and Footnotes
5,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
6,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
41,2000,Euro area (18 countries),Total public expenditure on education as % of ...,:,NaN
42,2001,Euro area (18 countries),Total public expenditure on education as % of ...,:,NaN
53,2000,Euro area (17 countries),Total public expenditure on education as % of ...,:,NaN
...,...,...,...,...,...
384,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
385,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
386,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
387,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
388,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [142]:
edu.isnull().sum()

TIME                    0
GEO                     0
A                       0
Value                   0
Flag and Footnotes    219
dtype: int64

In [ ]:
edu[edu['Value'].isnull()].head()

In [145]:
edu[edu.duplicated(['Value'])]

,TIME,GEO,A,Value,Flag and Footnotes
6,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
12,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
17,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
19,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e
20,2003,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e
...,...,...,...,...,...
374,2009,Slovakia,Total public expenditure on education as % of ...,4.09,d
375,2010,Slovakia,Total public expenditure on education as % of ...,4.22,d
380,2003,Finland,Total public expenditure on education as % of ...,6.43,NaN
383,2006,Finland,Total public expenditure on education as % of ...,6.18,NaN
384,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN

In [ ]:
edu[edu.duplicated()]

In [ ]:
edu.drop_duplicates('Value')

# Manipulating Data

In [146]:
edu.head()

,TIME,GEO,A,Value,Flag and Footnotes
5,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
6,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
7,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
8,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
9,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [ ]:
edu['Value'].head()

In [148]:
edu['TIME_100'] = edu['TIME'] / 100 # you can apply it by one step

In [150]:
edu.head(2)

,TIME,GEO,A,Value,Flag and Footnotes,TIME_100
5,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,20.00
6,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,20.01

In [ ]:
def y(x):
    return x*2

In [151]:
y = lambda x: x*2
y(3)

6

In [156]:
edu['TIME'] = edu['TIME'].map(y)

In [157]:
edu.head(2)

,TIME,GEO,A,Value,Flag and Footnotes,TIME_100
5,8000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,20.00
6,8004,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,20.01

In [ ]:
def z(t, v):
    if v == ':':
        return t*2
    else:
        return t

In [173]:
z = lambda t, v: t*2 if v==":" else t
z(2, ":")

4

In [175]:
edu['new'] = edu[['TIME', 'Value']].apply(lambda x:  x[0]*2 if x[1]==":" else x[0] , axis=1)

/var/folders/9n/yvd02hfx57z6hx0832zwsdrr0000gn/T/ipykernel_17340/1870585898.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  edu['new'] = edu[['TIME', 'Value']].apply(lambda x:  x[0]*2 if x[1]==":" else x[0] , axis=1)

In [176]:
edu

,TIME,GEO,A,Value,Flag and Footnotes,TIME_100,new
5,8000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,20.00,16000
6,8004,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,20.01,16008
7,8008,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e,20.02,8008
8,8012,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e,20.03,8012
9,8016,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e,20.04,8016
...,...,...,...,...,...,...,...
384,8028,Finland,Total public expenditure on education as % of ...,5.90,NaN,20.07,8028
385,8032,Finland,Total public expenditure on education as % of ...,6.10,NaN,20.08,8032
386,8036,Finland,Total public expenditure on education as % of ...,6.81,NaN,20.09,8036
387,8040,Finland,Total public expenditure on education as % of ...,6.85,NaN,20.10,8040
388,8044,Finland,Total public expenditure on education as % of ...,6.76,NaN,20.11,8044

In [178]:
# we can apply any function to a DataFrame or Series
edu['TIME'].apply(np.sqrt) # sqrt function from the numpy library

5      89.442719
6      89.465077
7      89.487429
8      89.509776
9      89.532117
         ...
384    89.599107
385    89.621426
386    89.643739
387    89.666047
388    89.688349
Name: TIME, Length: 384, dtype: float64

In [ ]:
def f2(x, r ):
    if x > 2002 and r == ":":
        return 1
    else:
        return 0

In [ ]:
edu['new'] = edu[['TIME', 'Value']].apply(lambda c : f2(c[0],c[1]), axis=1)

In [ ]:
edu.drop('TIME_1', axis=1, inplace=True)

In [ ]:
edu.head(2)

In [ ]:
def f2(x):
    return x**2
edu['Value'].apply(f2)

In [ ]:
edu['Value'].apply(lambda d: d**2)

In [ ]:
# add a new column to a DataFrame
edu['ValueNorm'] =

In [ ]:
edu[['Value','TIME']].apply(lambda)

In [ ]:
# add a new column to a DataFrame
edu['ValueNorm'] = edu['Value'] / edu['Value'].max()
edu.tail()

In [ ]:
edu

In [ ]:
# remove this column from the DataFrame
# rows(axis=0), columns(axis=1) 
# inplace = False (default), inplace=True (change original DataFrame)
edu.drop('ValueNorm', axis=1, inplace=True)
edu.head()

In [ ]:
edu

In [ ]:
# insert a new row
# ignore_index=True, otherwise the index 0
edu = edu._append({'TIME': 2000, 'Value': 5.00, 'GEOq': 'a'}, ignore_index=True)
edu.tail()

In [ ]:
# remove row(axis=0)
# inplace = False (default), inplace=True (change original DataFrame)
edu.drop(max(edu.index), axis=0, inplace=True)
edu.tail()

In [ ]:
# to clear data frame
edu.drop(edu.index, inplace=False)

# Sorting

In [179]:
edu

,TIME,GEO,A,Value,Flag and Footnotes,TIME_100,new
5,8000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,20.00,16000
6,8004,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,20.01,16008
7,8008,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e,20.02,8008
8,8012,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e,20.03,8012
9,8016,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e,20.04,8016
...,...,...,...,...,...,...,...
384,8028,Finland,Total public expenditure on education as % of ...,5.90,NaN,20.07,8028
385,8032,Finland,Total public expenditure on education as % of ...,6.10,NaN,20.08,8032
386,8036,Finland,Total public expenditure on education as % of ...,6.81,NaN,20.09,8036
387,8040,Finland,Total public expenditure on education as % of ...,6.85,NaN,20.10,8040
388,8044,Finland,Total public expenditure on education as % of ...,6.76,NaN,20.11,8044

In [183]:
edu.sort_values(by='TIME', ascending=True, inplace=True)
edu.tail()

,TIME,GEO,A,Value,Flag and Footnotes,TIME_100,new
112,8044,Bulgaria,Total public expenditure on education as % of ...,3.82,NaN,20.11,8044
52,8044,Euro area (18 countries),Total public expenditure on education as % of ...,5.15,e,20.11,8044
148,8044,Germany (until 1990 former territory of the FRG),Total public expenditure on education as % of ...,4.98,NaN,20.11,8044
64,8044,Euro area (17 countries),Total public expenditure on education as % of ...,5.15,e,20.11,8044
388,8044,Finland,Total public expenditure on education as % of ...,6.76,NaN,20.11,8044

In [184]:
# to return to the original order, we can sort by an index using the sort_index and axis=0
edu.sort_index(axis=1, ascending=True, inplace=True)
edu.head()

,A,Flag and Footnotes,GEO,TIME,TIME_100,Value,new
5,Total public expenditure on education as % of ...,NaN,European Union (28 countries),8000,20.0,:,16000
161,Total public expenditure on education as % of ...,NaN,Ireland,8000,20.0,4.29,8000
377,Total public expenditure on education as % of ...,NaN,Finland,8000,20.0,5.89,8000
245,Total public expenditure on education as % of ...,NaN,Lithuania,8000,20.0,5.63,8000
101,Total public expenditure on education as % of ...,NaN,Bulgaria,8000,20.0,3.88,8000

# Grouping Data

In [ ]:
# By â€œgroup byâ€ we are referring to a process involving one or more of the following steps:
# 1. Splitting the data into groups based on some criteria
# 2. Applying a function to each group independently
# 3. Combining the results into a data structure

In [185]:
edu

,A,Flag and Footnotes,GEO,TIME,TIME_100,Value,new
5,Total public expenditure on education as % of ...,NaN,European Union (28 countries),8000,20.00,:,16000
161,Total public expenditure on education as % of ...,NaN,Ireland,8000,20.00,4.29,8000
377,Total public expenditure on education as % of ...,NaN,Finland,8000,20.00,5.89,8000
245,Total public expenditure on education as % of ...,NaN,Lithuania,8000,20.00,5.63,8000
101,Total public expenditure on education as % of ...,NaN,Bulgaria,8000,20.00,3.88,8000
...,...,...,...,...,...,...,...
112,Total public expenditure on education as % of ...,NaN,Bulgaria,8044,20.11,3.82,8044
52,Total public expenditure on education as % of ...,e,Euro area (18 countries),8044,20.11,5.15,8044
148,Total public expenditure on education as % of ...,NaN,Germany (until 1990 former territory of the FRG),8044,20.11,4.98,8044
64,Total public expenditure on education as % of ...,e,Euro area (17 countries),8044,20.11,5.15,8044
388,Total public expenditure on education as % of ...,NaN,Finland,8044,20.11,6.76,8044

In [202]:
s = list(edu.groupby('GEO'))
s[30][1]

,A,Flag and Footnotes,GEO,TIME,TIME_100,Value,new
353,Total public expenditure on education as % of ...,NaN,Slovenia,8000,20.00,:,16000
354,Total public expenditure on education as % of ...,NaN,Slovenia,8004,20.01,5.86,8004
355,Total public expenditure on education as % of ...,NaN,Slovenia,8008,20.02,5.76,8008
356,Total public expenditure on education as % of ...,NaN,Slovenia,8012,20.03,5.80,8012
357,Total public expenditure on education as % of ...,NaN,Slovenia,8016,20.04,5.74,8016
358,Total public expenditure on education as % of ...,NaN,Slovenia,8020,20.05,5.73,8020
359,Total public expenditure on education as % of ...,NaN,Slovenia,8024,20.06,5.72,8024
360,Total public expenditure on education as % of ...,NaN,Slovenia,8028,20.07,5.15,8028
361,Total public expenditure on education as % of ...,NaN,Slovenia,8032,20.08,5.20,8032
362,Total public expenditure on education as % of ...,NaN,Slovenia,8036,20.09,5.69,8036
363,Total public expenditure on education as % of ...,NaN,Slovenia,8040,20.10,5.68,8040
364,Total public expenditure on education as % of ...,NaN,Slovenia,8044,20.11,5.68,8044

In [209]:
edu[['GEO','TIME', 'new', 'TIME_100']].groupby('GEO').mean()

,TIME,new,TIME_100
GEO,,,
Austria,8022.0,8022.000000,20.055
Belgium,8022.0,8688.666667,20.055
Bulgaria,8022.0,8022.000000,20.055
Cyprus,8022.0,8022.000000,20.055
Czech Republic,8022.0,8022.000000,20.055
Denmark,8022.0,8022.000000,20.055
Estonia,8022.0,8022.000000,20.055
Euro area (13 countries),8022.0,8688.666667,20.055
Euro area (15 countries),8022.0,8688.666667,20.055
Euro area (17 countries),8022.0,9355.666667,20.055
Euro area (18 countries),8022.0,9355.666667,20.055
European Union (25 countries),8022.0,8022.000000,20.055
European Union (27 countries),8022.0,8022.000000,20.055
European Union (28 countries),8022.0,9355.666667,20.055
Finland,8022.0,8022.000000,20.055
France,8022.0,8022.000000,20.055
Germany (until 1990 former territory of the FRG),8022.0,8022.000000,20.055
Greece,8022.0,12039.000000,20.055
Hungary,8022.0,8022.000000,20.055
Ireland,8022.0,8022.000000,20.055
Italy,8022.0,8022.000000,20.055
Latvia,8022.0,8022.000000,20.055
Lithuania,8022.0,8022.000000,20.055
Luxembourg,8022.0,11368.000000,20.055
Malta,8022.0,8022.000000,20.055
Netherlands,8022.0,8022.000000,20.055
Poland,8022.0,8022.000000,20.055
Portugal,8022.0,8022.000000,20.055
Romania,8022.0,9360.000000,20.055
Slovakia,8022.0,8022.000000,20.055
Slovenia,8022.0,8688.666667,20.055
Spain,8022.0,8022.000000,20.055

In [ ]:
# like group by in sql
group = edu[['GEO', 'Value']].groupby('GEO').mean()
group.head()

# Merging Data

In [ ]:
np.random.randn(10, 4)

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4))

In [ ]:
s = df[:3]
s

In [ ]:
ss = df[3:7]
ss

In [ ]:
df[7:]

In [ ]:
pd.concat([s, ss], axis=1)

In [ ]:
pd.merge(left, right, on="key")

# Resources
- Chapter 2, Introduction to Data Science by Laura Igual and Santi SeguÃ­
    - https://github.com/DataScienceUB/introduction-datascience-python-book 
- pandas Documentation: https://pandas.pydata.org/